package com.bignerdranch.android.permtourism.model

import com.bignerdranch.android.permtourism.R

class Arrays() {
    val imageId = arrayOf(
        R.drawable.kungur,
        R.drawable.hohl,
        R.drawable.palec,
        R.drawable.kungur,
        R.drawable.kungur,
        R.drawable.kungur,
        R.drawable.kungur)
    val title = arrayOf(
        "Кунгурская ледяная пещера",
        "Хохловка (музей)",
        "Усьвинские Столбы (Чертов Палец)",
        "",
        "",
        "",
        "")
    val description = arrayOf(
        "Одна из крупнейших карстовых пещер в Европейской части России, седьмая в мире гипсовая пещера по протяжённости." +
                " Протяжённость пещеры по данным на 2021 год составляет около 8153 м, из них около 2 километров оборудовано" +
                " для посещений туристами. Температура воздуха в центре пещеры от +5 °C до −2 °C, относительная влажность в" +
                " центре пещеры — 100 %. Кунгурская пещера содержит 58 гротов, 70 озёр, 146 т. н. «органных труб» (самая высокая" +
                " — в Эфирном гроте, 22 м) — высоких шахт, доходящих почти до поверхности. Возраст пещеры оценивается в 10-12 тысяч лет.",
        "Архитектурно-этнографический музей в Пермском крае, основанный в 1969 году. Открыт для посетителей 17 сентября 1980 года." +
                " Музей расположен на живописном берегу реки Камы в 43 км к востоку от Перми, в пределах села Хохловка. Это первый на" +
                " Урале музей деревянного зодчества под открытым небом. Музей «Хохловка» является одним из крупнейших центров притяжения" +
                " туристов в Пермском крае. За последние годы в музее проведено укрепление берегов залива и благоустройство набережной," +
                " установлены мачты освещения. Для гостей музея открыта чайная. В то же время, в музее не появляется новых памятников," +
                " а многие существующие объекты требуют серьёзной реставрации. Также недостаточно развита туристическая инфраструктура в зоне музея.",
        "Уникальные Усьвинские каменные столбы на реке Усьва, вытянувшиеся в длину на несколько километров и достигающие высоты 120 метров," +
                " по праву считаются одним из любимых и притягательных мест туристов Пермского края. Усьвинские Столбы — это огромный каменный" +
                " массив на правом берегу реки Усьвы, сложенный известняками. На камнях можно встретить отпечатки древних кораллов," +
                " брахиопод и другие окаменелости, напоминающие о том, что много миллионов лет назад здесь плескалось море. Впервые" +
                " Столбами с научной точки зрения заинтересовался геолог А.А. Краснопольский. В 1889 году он вместе с группой коллег" +
                " определил главные составляющие разреза, датировал его и описал в научной работе состав пород.",
        "",
        "",
        "")
    val latitude = doubleArrayOf(
        57.440953609793006,
        58.26045420545549,
        52.93717621041027,
        4.0,
        5.0,
        6.0,
        7.0)
    val longitude = doubleArrayOf(
        57.00587191043038,
        56.26078480249001,
        56.79645161088171,
        4.0,
        5.0,
        6.0,
        7.0)
    val favorites = arrayOf(
        false,
        false,
        false,
        false,
        false,
        false,
        false)
}

